Revit 2027 API
BuiltInFailures.SketchFailures.OpenLoopPath3d Property
 Lines must be in closed loops. The highlighted lines are open on one end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenLoopPath3d { get; }
Public Shared ReadOnly Property OpenLoopPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenLoopPath3d {
	FailureDefinitionId^ get ();
}
static member OpenLoopPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace